---
kind: method
id: M:Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Contains(Autodesk.Revit.DB.Electrical.TemperatureRatingType)
source: html/e8f37e5b-abd6-df9d-06af-6ee7a6212ef6.htm
---
# Autodesk.Revit.DB.Electrical.TemperatureRatingTypeSet.Contains Method

Tests for the existence of a TemperatureRating type within the set.

## Syntax (C#)
```csharp
public virtual bool Contains(
	TemperatureRatingType item
)
```

## Parameters
- **item** (`Autodesk.Revit.DB.Electrical.TemperatureRatingType`) - The TemperatureRating type to be searched for.

## Returns
The Contains method returns True if the TemperatureRating type is within the set, otherwise False.